// 1 - Создать произвольный елемент с id = text.  Используя JavaScript, сделайте так, чтобы при клике на кнопку исчезал
// элемент с id="text".
let text = document.getElementById('text');
text.style.background = 'pink';
text.style.width = '200px';
text.style.height = '200px';
text.style.borderRadius = '50%';


let btn1 = document.getElementsByClassName('btn1')[0];
btn1.style.background = 'skyblue'

btn1.onclick = function () {
    text.style.display = 'none'

}

// 2 - Создайте кнопку, при клике на которую, она будет скрывать сама себя.

let btn2 = document.getElementsByClassName('btn2')[0];
btn2.style.background = 'red'

btn2.onclick = function () {
    btn2.style.display = 'none'

}


// 3 - створити інпут, який приймає вік людини та кнопку яка підтверджує дію.При натисканні на кнопку
// зчитати інформацію з інпуту та перевірити вік чи меньше він ніж 18, та повідомити про це користувача


let btn3 = document.getElementById('btn3');

btn3.onclick = function () {
    let age = document.getElementById('age').value;
    if (+age < 18) {
        console.log('Your age is less than 18');
    } else if (+age >= 18) {
        console.log('Your age is more than 18, welcome');
    } else {
        console.log('enter once more');
    }

}

// 4 - Создайте меню, которое раскрывается/сворачивается при клике

let menu = document.getElementsByClassName('menu')[0];
let header = document.getElementsByClassName('header')[0];
let wrap = document.getElementsByClassName('wrap')[0];


header.onclick = function () {
    wrap.style.display = 'none'

}


console.log(menu);


// 5 - Создать список комментариев, пример объекта коментария - {title : 'lorem', body:'lorem ipsum dolo sit ameti'}.
//     Вывести список комментариев в документ, каждый в своем блоке.
//     Добавьте каждому комментарию по кнопке для сворачивания его body.

let planets = [
    {
        title: 'Меркурій',
        body: 'Меркурій залишається найменш вивченою планетою земної групи. На її дослідження було спрямовано лише два апарати. Першим був «Марінер-10», що у 1974—1975 роках тричі пролетів повз Меркурій: максимальне зближення становило 320 км. У результаті було отримано кілька тисяч знімків із середньою роздільною здатністю 1 км/пікс, що охоплюють приблизно 45 % поверхні планети[10]. Подальші дослідження з Землі дозволили отримати деякі дані про поверхню та атмосферу Меркурія, зокрема вказали на можливість існування водяного льоду в полярних кратерах.'
    },
    {
        title: 'Венера',
        body: 'Вене́ра — друга від Сонця та шоста за розміром планета Сонячної системи. Період обертання навколо Сонця — 224,7 земних діб. Названа на честь Венери, богині кохання з римського пантеону. Це єдина з восьми основних планет Сонячної системи, яка отримала назву на честь жіночого божества. За розміром майже така ж, як і Земля.'
    },
    {
        title: 'Земля',
        body: 'Земля́ — третя від Сонця планета Сонячної системи, єдина планета, на якій відоме життя, домівка людства. Земля належить до планет земної групи і є найбільшою з цих планет у Сонячній системі. Землю іноді називають світом, латинською назвою Терра або грецькою — Гея.'
    },
    {
        title: 'Марс',
        body: 'Четверта планета Сонячної системи за відстанню від Сонця та сьома за розміром і масою. Названа на честь Марса — давньоримського бога війни. Іноді Марс називають «червоною планетою» через червонуватий колір поверхні.'
    },
    {
        title: 'Марс',
        body: `Юпі́тер — п'ята від Сонця та найбільша планета Сонячної системи. Відстань Юпітера від Сонця змінюється в межах від 4,95 до 5,45 а. о. (740—814 млн км), середня відстань 5,203 а. о. (778 млн км). Разом із Сатурном, Ураном і Нептуном Юпітер класифікують як газового гіганта.`
    },
    {
        title: 'Сатурн',
        body: 'Сату́рн — шоста за віддаленістю від Сонця та друга за розмірами планета Сонячної системи. Сатурн швидко обертається навколо своєї осі (з періодом — 10,23 години), складається переважно з рідкого водню і гелію, має товстий шар атмосфери. '
    },
    {
        title: 'Уран ',
        body: 'Уран — сьома від Сонця велика планета Сонячної системи, що належить до планет-гігантів. Діаметр Урана в 4 рази, а його маса — в 14,5 раза більші за земні, що робить його третьою за діаметром та четвертою за масою планетою Сонячної системи.'
    },
    {
        title: 'Нептун',
        body: 'Нептун — планета Сонячної системи, восьма за віддаленістю від Сонця. Вона четверта за розміром у Сонячній системі, третя за масою і належить до планет-гігантів. Її орбіта перетинається з орбітою Плутона в деяких місцях. '
    }


];
for (const planet of planets) {
    let hr = document.createElement('hr');
    let containerDiv = document.createElement('div');
    let titleH2 = document.createElement('h2');
    let bodyP = document.createElement('p');
    let btn4 = document.createElement('button');

    titleH2.innerText = planet.title;
    bodyP.innerText = planet.body;
    btn4.innerText = 'згорнути'


    document.body.appendChild(hr);
    document.body.appendChild(containerDiv);
    containerDiv.appendChild(titleH2);
    containerDiv.appendChild(bodyP);
    containerDiv.appendChild(btn4);

    btn4.onclick = function () {
        bodyP.style.display = 'none'

    }
    console.log(containerDiv);
}

